import React, { useState } from 'react';
import { View, ScrollView, StyleSheet, Image, Text, TouchableOpacity, Dimensions } from 'react-native';
import ImageViewer from 'react-native-image-zoom-viewer';

const images = [
  {
    id: 1,
    imageUrl: 'https://firebasestorage.googleapis.com/v0/b/lalibela-b39ae.appspot.com/o/newforall%2Fnakuto-lab-rock-church-amhara-region-lalibela-ethiopia-G19YJY.jpg?alt=media&token=0bc72a8a-7e5f-4725-8fe6-f4565a51c759',
    description: `ቅዱስ ናአኩቶላአብ።
    ቅዱስ ላሊበላ ቅዱስ ነአኩቶለአብን መንግሥቴን ተረከበኝ እና ቤተ-እግዚአብሔርን እያገለገልክ ኢትዮጵያን አፍሪካን አህጉራቱንም ጭምር አስተዳድር ብሎ እሱ ያስተዳድራቸው የነበረውን አህጉራት ነገረው፡፡
     ቅዱስ ነአኩቶለአብም "እኔ አባቴ እንዴት ብሎ ይሆንልኛል እድሜየም አቅሜም ትንሽ ነው” አለው:: እሱም "ቅዱስ ላሊበላ እኔ አልለይም እሽ በለኝ' አለው:: 
     በዚህ ጊዜ ግድ ሆነበትና ፈቃደኛ ሆነ:: እሽ ብሎ በአልጋ ወራሽነት መንግሥቱን በ1190 ዓ.ም ተረክቦ መላዕክት አስቀድመው እንደነገሩት ነጭ ቆቅ /ወፍ/ እየመራው ዛሬ ቆቅና እየተባለ ከሚጠራው መሀል ደብር አለፈና ቦታዋን ሲጎበኝ መርቶ ያመጣው ነጭ ቆቅ ተነስቶ በስሙ ነአኩቶለአብ አሚባለው ዋሻ ቤተመቅደስ ሄዶ ገባ እርሱም ተከትሎ ዋሻውን አገኘው::
     ዋሻውን - ደልድሎ የእስጢፋኖስ ሰማዕትንና እና የእመቤታችንን ጽላት አስገብቶ እያጠነ ማገልገል ጀመረ፡፡ ቤተ መንግሥቱን ቆቅና/ዛሬ መሐል ደብር ከሜዳዋ ላይ/ አድርጎ ተቀመጠ፡፡ ቦታዋ ቤተመንግሥቱ እንደ ሞሰብ ክብ ዙሪያዋ በገደል የታጠረች ወደላይ የገደል ጥግ ያላት በውበት የተዋጠች ቦታ ናት፡፡ ቅዱስ ላሊበላም ቤተ-ማርያም ፊት ለፊት ቤተ-ጎልጎታ እራስ ላይ ከጸሎት ቦታው ሆኖ ቅዱስ ነአኩቶለአብን በአልጋ ወራሽነት በአባቱ በቅዱስ ላሊበላ ፈቃድ እያስተዳደረ ሳለ ከዚህ በኋላ ቅዱስ ላሊበላ የክርስትና ልጁን ነአኩቶለአብን እንዲህ አለው መንግሥቴን ሙሉ በሙሉ ተቀበለኝ እኔና ዘመዶቼ ስናስተዳድራቸው የኖርነውን አህጉራት ኢትዮጵያንና ዙሪያዎቹንም በሃይማኖት፣ በፍቅር፣
በትህትና አስተዳደር ብሎ አነገሠው:: ዘውዱን የጫነበት ቅብዓ-መንግሥቱን የቀቡት መላእክት ናቸው:: በ1194 ዓ.ም
ኀዳር 3 ቀን ነግሦ ከክርስትና አባቱ ቃለ በረከት ተቀብሎ እያስተዳደረ ሳለ ግብጸውያን ለኢትዮጵያ ነገሥታት ለነቅዱስ ላሊበላ ግብር ይገብሩ የነበረውን ግብር አስቀሩት፡፡ በአባይ ውሃ ይገበር የነበረው ግብር ሲቀርበት ቅዱስ ነአኩቶለአብ አዘነ፡፡ ወደ ፈጣሪው እንዲህ አለ “ሳይገባኝ ሆኖን ነው የነገሥኩት ወይስ ፈጣሪዬን አስቀይሜ ነውን የአባቶቼን የነቅዱስ ይምርሃነ ክርስቶስን የነቅዱስ ላሊበላን የኢትዮጵያን ሀብት ግብር ሲገበር የነበረው መቅረቱ" እያለ ወደ ፈጣሪው እየሰገደ በጸሎት አመለከተ:: ከዚህ በኃላ የአባይ ውሃ የኢትዮጵያን ምድር ጨርሶ ከግብጽ ድንበር ሲደርስ እንደ ግድግዳ ቆሞ ወደ ግብጽ አልሻገርም አለ፡፡ ግብፃዊያንም ውሃው ሲቆምባቸው ቢጎትቱት እንቢ አላቸው፡፡ 3 ዓመት
ከ3ወር ሆነው በዚህ ጊዜ ግብፃዊያን በከፋ ድርቅ ተመቱ ገንዘባቸውም አለቀ ሰውም በርሀብ ሞተ:: ከዚህ በኃላም ማማስ የተባለ የሀገሩ ተጠሪ ሰው ከባለቤቱ ከመቅደላዊት ጋር ግብጽን እዞረ ለህዝቡ እንዲህ እያለ ያስተምር ጀመረ:: “የኢትዮጵያ ነገሥታት በላስታ ምድር የሚኖሩት የእግዚአብሔር ወዳጆች ከመሆናቸውም በላይ እግዚአብሔር በእጃቸው በመሆኑ ውሃውን አግደውታል :: ምክንያቱም የኢትዮጵያን ገንዘብ ውሃ አባይን ግብሩን ስንገብርበት የነበረው በማስቀረታችን ነው፡፡ አሁንም ግብሩን ስፍረን ቆጥረን ካስቀረንበት ጀምረን ብንገብር የአባይ ውሃ እንደሚሻገርልን ነው::" በማለት በጥብቅ እየዞረ አስተማረ ከዚህ በኃላ ግብፃዊያን የማማስንና የመቅደላዊትን ቃል ሰምተው ለቅዱስ ላሊበላ 
ሲገበር የነበረውን የአባይን የውሃ ግብር እንደቀድሞው አገባበራቸው የ3ቱን ዓመት ጨምረው የ6 ዓመት አድርገው ግብሩን አሰባስበው ከዚያ በላይ ለንጉሡ ለቅዱስ ነአኩቶለአብ የወርቅ ስዕለ ኪሩብ የወርቅ ዘውድ ልዩ ልዩ ዓይነት የእጅ መንሻ ሽልማት ይዘው ጳጰሳት ቀሳውስት ዲያቆናት የሐገር ሽማግሌዎች ተመልምለው በአጋሰስ ጭነው ተጉዘው ሽምሽሃ ሥላሴ ከአየር ማረፊያው አጠገብ ዛሬ ግብጻዊት አቡነ ገብረ መንፈስ ቅዱስ እየተባለ ከሚጠራው ቦታ ደርሰው ሰፍረው ሳለ በመንገድ ድካም የጠናባቸውን ታመው የነበሩት ከፊል ሰዎች ከዚሁ ግብፃዊት አቡነ ገብረ መንፈስ ቅዱስ ቀጭን አበባ ከወንዙ ዳር ከሰፈሩበት ላይ በሞት ተለዩ∶: ከዚሁ ቀበሯቸው:: ስለዚህ ቦታዋን በዚሁ ምክንያት ግብጻዊት አቡነ ገብረ መንፈስ ቅዱስ ብለው እየጠሯት ትገኛለች፡፡ 
የበረቱትና ባለጤናዎቹ ዘልቀው ከቅዱስ ነአኩቶለአብ ቆቅህና መሃል ደብር ከቤተመንግሥቱ ገብተው የያዙትን ግብርና አምሓ ከቅዱስ ነአኩቶለአብ ፊት አቀረቡ:: ከጫማው ወድቀው "ማረን በድለናል ዳግመኛ ይህን ስራ አንሰራውም በኢትዮጵያ እየተጠቀምን የምንገብረውን የአባይን እና የተከዜን ውሃ ግብር ሀገራችን ግብፅ እየገበረች የምትኖረውን አስቀርተን ህዝባችን እና ንበረታችን አልቋል" ብለው የንስሐ ስርየት ጠየቁት:: እርሱም ንጉሡ ቅዱስ ነአኩቶለአብ ከታወቃችሁማ በደላችሁን ካመናችሁና ደግማችሁ የማትበድሉ ከሆነ ይቅር ብያችኋለሁ ብሎ ሲናገር እግዚአብሔር ለወዳጆቹ ቅርብ ነውና የአባይ ውሃ ከድንበሩ እነደግድግዳ ሶስት ዓመት ከሶስት ወር ቁሞ የነበረው እለቱን ተሻግሮ መሬታቸውን አጠጣላቸው ሶስት ዓመት መሉ እየተዘራ የቀረው ከመሬት የወደቀው ዘር አዝመራቸው በአንድ ቀን ውስጥ ማለትም እለቱን በቅሎ እለቱን አሽቶ እለቱን አፍርቶና እለቱን ደርቆላቸው አጭደው ወቅተው በልተው አደሩ::
 ከዚህ መጥተው የነበሩት ግብጻውያን ከሀገራቸው ተመልሰው ሲደርሱ ውሃው መቼ ገብቶ ነው ባሉ ጊዜ በአንድ ቀን ውስጥ እለቱን በቅሎ እለቱን አሽቶ እለቱን አፍርቶና እለቱን ደርቆላቸው አጭደው ወቅተው እንደተመገቡ ነገሯቸው:: ቅዱስ ናአኩቶለአብ ይቅር ባለ ጊዜ እለቱን ባንድ ቀን በቅሎ እለቱን ታጭዶ ወቅተው እንደበሉ አስረዷቸው ስለዚህ ግብጻውያን ለኢትዮጵያ ነገሥታት ፍጹም የእግዚአብሔር እንደራሴዎች መሆናቸውን አረጋገጡ:: ከዚያን ቀን ጀምሮ ግብጻውያን ለኢትዮጵያን ነገሥታት የአባይን ውሀ ግብር ሳያቋርጡ በቅዱስ ላሊበላ ስም እየተላከ ስልሳ ሚሊየን ሃምሳ ሚሊዮን የኢትዮጵያ ነገሥታት እየተረከቡ ለቅዱስ ላሊበላ አስራት የአስራት አስራት አትርሱኝ እየተባለ ሲላክ ይኖራል:: 
 አዚህም በኋላ ቅዱስ ነአኩቶለአብ ከአባቱ ከቅዱስ ላሊበላ የተረከበውን አደራ ንጉሠ ነገሥትነት ይዞ ቤተ-መንግሥቱን ቆቅ እየመራው ከአስቀመጠው ከላይ ክጠቀስነው ቦታ ላይ በቆቁ ስም ቆቅህና በማለት ስሟን እየጠሩት ከምትገኘው ቤተ-መንግሥቱን አድርጎ አርብ አርብ አምስት የብረት ችንካር አሰርቶ ችንካሮቹን ከመሬት ላይ ተክሎ ከችንካሮቹ ላይ እየተኛ ችንካሮቹም ሰውነቱን ቀደው እስከሚወጡ የፈጣሪውን የመድኃኔዓለምን መከራ ሞት በእለተ አርብ የተቀበለውን ለአዳም ልጆች ሲል እያሰበ አርብ አርብ በችንካር ላይ ይውል ነበር:: በሌሎች ቀናት ሌሊት ሌሊት ከአመድ ላይ ከምድጃ ተኝቶ ወገቡን በሰንሰለት አስሮ እየጸለየ እና እየሰገደ ያድራል ቀን ቀን ጮማ የቆረጠ ጠጅ የጨለጠ መስሎ የክብር ልብስ ለብሶ የተጣላ ሲያስታረቅ የተቀማ ሲያስመለስ ፍትሕ ርትዕ ሲያይ ይውላል::
`,
  },
  {
    id: 2,
    imageUrl: 'https://firebasestorage.googleapis.com/v0/b/lalibela-b39ae.appspot.com/o/newforall%2Fchurch-inside-the-cave%20(1).jpg?alt=media&token=f0aa64f0-9aa2-40a8-afa4-45d1dfee119e',
    description: `ቅዱስ ነአኩቶለአብ 43 ዓመት በንጉሠ ነ ሲያስተዳድር በስልጣነ-ክህነት ሲቀድስ ሲያቀርብ) ሲያጥን ሲጸለይ በቅዱስ ሚካኤልና በቅዱስ ገብርኤል በሁለቱ ን ተደግፎ ከሰማይ እየወጣ ከሃያአራቱ ካህናተ ሰማይ ጋር መንበረ ጸባኦቱን እያጠነ ይመጣ ነበር፡፡
    የሰራቸውን ቤተ-መቅደሶች በመጨረሻ አሽተን ደብረ ጽዮንን የመንፈስ ቅዱስ አባቱ ቅዱስ ላሊበላ ለማነጽ ጀምሯት ነበር። የተጀመረቸውን አንጾ ጨርሶ ታቦተ-ጽዮንን አስጉብቶ ሁለተኛ አንጎት በቅሎ ማነቂያ አጠገብ ዋሌ ኢየሱስን ዋሻውን እንጾ ለአካባቢው ህዝብ አስረክቦ ሲጨርስ ሥዕለ-ስቅለት ከስዕለ-ሐዋርያት ጋር ስዕለ መላእክት ያለው መንበር አስገብቶ እንዲቀደስ አድርጎ ስርቶ መርቶ ከመጣ በኃላ ገና ሳያርግ ኢየሱስ ክርስቶስ የሰጠው ቃልኪዳን ከብዙ በጥቂቱ ይህን የመሰለ ነው፡፡ “ስምህን ጠርቶ ከቅርብም ከሩቅም የመጣ ቤተ-ክርስቲያንህን የሰራ በስምህ የተማመነ ከደጅህ መጥቶ ጸበልህን ጠጥቶ ገድልህን ተሳልሞ ደጅህን ረግጦ የሄደ ሁሉ ያንድ ግመል ጭነት ጤፍ ቁጥር ያህል ምሬልሃለሁ:: ዝክርህን የዘከረ እስከ ሰባት ትውልድ
ምሬልሃለሁ:: በድጋሚ የወንዝ አሸዋ ቁጥር ያህል ጨምሬ ምሬልሃለው፡፡'' አለው፡፡ ከዚህ ከሰራቸው ህንጻዎች ከላይኛይቱ አሸተን ደብረጽዮን ከታችኛይቱ በስሙ ነአኩቶ ለአብ አንዲት ቤተ-መቅደስ ተብለው ከሚጠሩት ከታችኛው ሲያጥን ቆይቶ ወደ ላይኛይቱ ሲወጣ መላእክት በእሳት ስረገላ ህዳር 3 ቀን አሳረጉት፡፡ ዛሬ ከዚችው ዋሻ ቤተ- መቅደስ ውስጥ የሚፈልቀው ጸበል እሱ ከቀደሰባት ካጠነባት ከጸለየባት ቀን በቀን የሚፈወሰው ህመምተኛ በየሀገሩ እየመጣ በቁጥር አይለካም:: አብዶ በገመድ ታስሮ የመጣው፧ ሆዱ አብጦ (ተነፍቶ) የሚመጣው ሰው በጠቅላላ ደዌ መንፈስ-ርኩስ የተያዘ ሁሉ እየተፈወሰ የሚሄደው ይህን
ያህል ተብሎ አይቆጠርም:: አንድ ቀን ያላሰሰ ታላቅ የህይወት ቦታ ነው:: የላስታ ምድር በጠቅላላ ቅዱስ ላሊበላ ያቀፋቸው ምድሮች (ቦታዎች) ህይወት ያላቸው ሙዚየሞች
ናቸው:: እየመጣችሁ ተጠቀሙባቸው::`,
  },
];

const Harbe = () => {
  const [showFullText, setShowFullText] = useState([]);

  const toggleText = (id) => {
    setShowFullText(prevState => ({
      ...prevState,
      [id]: !prevState[id],
    }));
  };

  return (
    <ScrollView>
      {images.map((image) => (
        <View key={image.id} style={{ marginVertical: 10,marginBottom:70 }}>
          <ImageViewer
            imageUrls={[{ url: image.imageUrl }]}
            enableSwipeDown
            renderIndicator={() => null} 
            style={{ width: Dimensions.get('window').width, height: Dimensions.get('window').height / 2 }}
          />
          <View style={styles.descriptionContainer}>
            <Text>{showFullText[image.id] ? image.description : `${image.description.substring(0, 100)}...`}</Text>
            {image.description.length > 100 && (
              <TouchableOpacity onPress={() => toggleText(image.id)}>
                <Text style={styles.seeMore}>{showFullText[image.id] ? 'በከፊል ይዩ' : 'ሙሉውን ይዩ'}</Text>
              </TouchableOpacity>
            )}
          </View>
        </View>
      ))}
    </ScrollView>
  );
};

export default Harbe;

const styles = StyleSheet.create({
  descriptionContainer: {
    paddingHorizontal: 10,
    paddingTop: 10,
    marginBottom:70,
  },
  seeMore: {
    color: 'blue',
    marginTop: 5,
  },
});
