import React, { useState } from 'react';
import { View, ScrollView, StyleSheet, Image, Text, TouchableOpacity, Dimensions } from 'react-native';
import ImageViewer from 'react-native-image-zoom-viewer';

const images = [
  {
    id: 1,
    imageUrl: 'https://firebasestorage.googleapis.com/v0/b/lalibela-b39ae.appspot.com/o/yimriha%2FETH%20Yemre-1.jpg?alt=media&token=141a2f01-e6d7-455e-94df-73f6a1fd4dee',
    description: `ቅዱስ ይምርሃነ ክርስቶስ።
    ሩፋኤል መልአክ ከባህር ላይ ድንጋይ ወይም ዋሻ ክዳኗ የሚሆናት ቤተክርስቲያን ትሰራለህ፤ ዓለም ሲያደንቀው ሃጢያተኞች ከፈጣሪያቸው ጋር ሲታረቁበት ይኖራሉ፣ እኔም አምላክህ እመሰገንበት አለሁ፡፡ ብዙ ሰዎች ከሃጢያት ይፈወሱበታል፤ የመንግሥተ ሰማያት በር መገቢያ ናት ብሎ ነገረው፡፡ ቅዱስ ይምርሃነ ክርስቶስ ከዛዚያ ተነስቶ ሽቅብ ወደ ምስራቅ አሁን ወደምንጓዝበት ቤተ መቅደስ ጉዞ ሲጀምር በረሃ ጫካ አጋም ቀጋ የተተበተበበት ነበር፡፡ አገሩ ህዝቡ በፈቃደ እግዚብሔር ተነሳስቶ በረሃውን የእንጨት መሳሪያ ይዞ እየመነጠረ ሩፋኤል መላኩ እየመራው ከዚችው ቦታ ሲደርስ ዋሻውና
    ባህሩ ገጥመው አገኛቸው፡፡ 
    ከዳሩ ላይ ሆኖ ቅዱስ ይምርሃነ ክርስቶስ በአንድ እግሩ ቆሞ ሲፀልይ ባህሩ ወደታች ዋሻው ወደ ላይ ተለያይተው ሲሄዱ ይታየው ጀመር፡፡
     በዚህ ጊዜ የቅዱስ ይምርሃነ ክርስቶስ ታዛዥ ብነ ክርስቶስ (ገብረማርያም) የሚባል አገልጋይ ነበረው። ከባህሩ ጋኔን ወጥቶ ታዛዡን ብነ ክርስቶስን ገድሎት ተመልሶ ከባህሩ ገባ፡፡ 
     በዚህ ጊዜ ቅዱስ ይምርሃነ ክርስቶስ መሪር ሃዘን አዘነ። ከዚህ መጣ ከዚ ቆየ ሳይባል ቅዱስ ቂርቆስ መጣለት፡፡ 
     ቅዱስ ቂርቆስ በዓመተ-ሰማእታት በ303 ዓ.ም በህፃንነቱ ገና በ3 ዓመቱ በሰማእትነት ከእናቱ ከእየሉጣ ጋር ያረፈ ሰው ነው:: 
በአፀደ ነፍስ መጥቶ ከምትሰራው ቤተመቅደስ ስሜን ከስምህ ጋር ትሰራልኝ እንደሆነ የሞተውን ታዛዥሀን ብነ ክርስቶስን 
ላድንልህ አለው:: ቅዱስ ይምርሃነ ክርስቶስም አድንልኝ እንጂ ስምህን ከስሜ ጋር እንዲጠራ አደርግልሃለሁ ሲል ቃል ገባለት፡፡ 
በዚህ ጊዜ ቅዱስ ቂርቆስ ብነ ክርስቶስን ቢባርከው ተነሳ ዳነ፡፡ ቅዱስ ቂርቆስ ከባህሩ እጁን ቢልክ ብነ ክርስቶስን የገደለው ሰይጣን ቸብቸቦው አገኘውና አውጥቶ ቢወረውረው ጎጃም ምድረ አቦላ ከተባለው ሄዶ ወደቀ። 
መልኩ የተለበለበ ግንድ ጥቁር ጨለማ ይመስላል። ቁመቱ 80 ክንድ ወርዱ 60 ክንድ ሆነ፡፡ 
ገድለ ቂርቆስን ተመልከት፡፡ 
እግዚአብሔር ሰይጣኑን በቅዱስ ቂርቆስ እጅ ስለገደለለት ቅዱስ ይምርሃነ ክርስቶስ ይህን አስደናቂ ህብሩ ይህ ነው ሊባል የማይቻል ቤተክርስቲያን ሊሰራ ሲጀምር እንጨቱን መላእክት እየቆረጡለት እየላኩለት ከገነት ዞቢ የሚባል እንጨት ነው የምትሰራበት ብሎ መላከ እግዚአብሔር ነገረው፡፡ 
በኃላ ከአገልጋዩ ክብነ ክርስቶስ (ክገብረማርያም/ጋር ወደ ገነት ተጉዘው ቢሄዱ እንደነገረ የገነት እንጨቶች ለቤተ መቅደስ ለመሆን የተመቻቹ ሆነው ተዘጋጅተው አገኛቸው፡፡ 
ከዚህ በኃላ ከቀን ሰባት ጊዜ ብነ ክርስቶስ አገልጋዩ የገነትን እንጨት ከመላእክት ጋር እየታገዘ በማመላለስ ከመስከረም12 ቀን እስከ ሰኔ 20 ቀን በአስር ወር ይህን ታሪካዊ ቤተመቅደስ ማንም - ሳይረዳው ብቻውን ቅዱስ ይምርሃነ ክርስቶስ ሰርቶ ጨረሰ፡፡
በእግዚአብሔር ስጦታ እና ፍቅር ሰርቶ ሰኔ 21 ቀን የእመቤታችን የድንግል ማርያም ቅዳሴ ቤት በሆነው እለት ቀድሶባታል፡፡ 
ህብስት ሰማያዊ ዕዋ ሰማያዊ ከታች ዛዚያ ከተባለው በድንኳን 22 ዓመት ሲቀድስ ይወርድለት የነበርው አሁንም ደግሞ ከዚችው ከሠራት ቤተ መቅደስ እየወረደለት ህዝቡን እየቀደሰ ያቆርብ ጀመር፡፡ 
ሲሰራው ይህን ታሪካዊና አስደማሚ የሆነው መቅደስ ዲዛይኑን ከሠው አልተማረውም፡፡ ከፈጣሪው በመንፈስ ቅዱስ ተቃኝቶ ነው እንጂ፡፡
 የቤተክርስቲያኑ አሰራር በሶስት ቤተመቅደስ ሲሆን
ቅዱስ ይምርሃነ ክርስቶስ ከዚች አሰራት ቤተ መቅደስ 18 ዓመት ቀድሶባታል ክታች ዛዚያ 22 ዓመት በድንኳን ቀድሷል። በድምሩ 40 ዓመት እግዚአብሔርን እየቀደሰ እያወደሰ ኖሮ በመጨረሻ የሰራኋትን ቤተ መቅደስ በወርቅ አጠልቃታለሁ ብሎ ወደ አረብ ምድር መንገድ ሲጀምር ቅዱስ ይመርሃነ ክርስቶስን እግዚአብሔር አምላክ ወዳጀ ሆይ ይምርሃነ ተው 
አትሂድ ራሷ ወርቅ ትሁንልህ እስከ ዕለተ ምጽአት ተጠብቃ ትኑርልህ ዓለም ከሃጢያቱ እየዳነባት እኔም እየተመሰገንሁባት ትኑርልህ አለው፡፡ ቅዱስ ይምርሃነ ክርስቶስ ግን አልቀርም -ብሎ መንገድ ጀመረ፡፡ ካሰበው ሳይደርስ ሞት መጣሁብህ ብሎ ነገረው፡፡ በዚህ ጊዜ ቅዱስ ይምርሃነ ክርስቶስ ወደ ፈጣሪው ቢያመለክት ነግሬህ አለነበርምን አሁንም ተመለስ አለውና ተመልሶ ከሰራት ቤተ መቅደስ መጥቶ ሳለ ፈጣሪው`,
  },
  {
    id: 2,
    imageUrl: 'https://firebasestorage.googleapis.com/v0/b/lalibela-b39ae.appspot.com/o/yimriha%2Fimages%20(1).jpg?alt=media&token=64677be7-ca05-409d-9e16-7afc895157ad',
    description: `ከላይ በወዲያና በወዲህ በሁለት አቅጣጫ ፎቅ አለው:: 
ጨረቃና ፀሃይ ከዋክብት ተስለውበታል፡፡ ውስጡ በሰባቱ 
ስማያት አምሳል እና ልክ መሰል ከጣርያው በስተውስጥ ይህ 
ነው ተብሎ ሊተረጎም የማይቻል ይታይበታል፡፡ በስተምስራቅ 
ከውስጥ ከመንበሩ ላይ መስኮት ይታያል፡፡ ይህም ከሰማይ 
የሚላክለት ህብስት ሰማያዊ እና ፅዋ ሰማያዊ መልኣኩ 
ፋኑኤል ይዞለት የሚገባበት እና ቅዱስ ይምርሃነ ክርስቶስ 
ተቀብሎ ቀድሶ ለህዝብ የሚያቆርብበት ነው፡፡ በስተ ውጭ 
መስኮቶቹ ሲታዩ እያንዳንዳቸው አይመሳሰሉም፡፡ ጣርያው 
ወይም ክዳኑ የድንጋይ ክዳን ሲሆን በስተደቡብ ከውጭ 
ከዋሻው የሰዎች አዕም በብዛት እስከ አካላቸው ሳይለያይ 
ይታያል፡፡ ይህ የሆነበትም ምክንያት ከሰማይ መልአኩ 
ፋኑኤል ህብስት ሰማያዊ ዕዋ ሰማያዊ ይዞ ወደ ኢትዮጵያ 
አቅጣጫ ሲወርድ በግብዕ 40 ዘመን ዘግቶ የሚኖር አንድ 
የበቃ ባህታዊ ያየዋል፡፡ በዚህ ጊዜ ለኔ የተላከ ነው ብሎ 40 
ዓመት ዘግቶ የኖረው ባህታዊ ወጥቶ እቀበላለሁ በማለት 
ሲመለከት ወደ ኢትዮጵያ አቅጣጫ ሲወርድ ያየዋል፡፡ ይህ 
ባህታዊ ስመ-እግዚአብሔር _ ጠርቶ መልአኩ ፋኑኤልን 
ወደየት ነው ይህን በረከት ሰማያዊ የምትወስደው ይለዋል፡፡ 
መላኩ ፋኑኤልም ለኢትዮጵያው ንጉሥ እና ካህን ቅዱስ 
ለሆነው ለይምርሃነ ክርስቶስ ውሰድ ተብዬ ከፈጣሪዬ ታዝዤ 
ነው ይለዋል፡፡ ይህ ባህታዊም እኔንም ውሰደኝ ከሱ እጅ 
ሥጋውንና ደሙን ልቀበል ብሎ መላኩ ፋኑኤልን ስመ 
እግዚአብሔር ጠርቶ እዲመራውና እንዲያደርሰው _ በቅዱስ 
ይምርሃነ ክርስቶስ እጅ ለመቀበል እፈልጋለሁ በማለት 
ተማፀነው፡፡ መላኩ ፋኑኤልም ለባህታዊው እንዲህ አለው፧
አንተ ብቻ ሳትሆን ከዚህ በግብፅ ውስጥ ሊሄዱ የሚችሉ ብዙዎች ሰዎች ይኖራሉ እና መጥቅዕ መትተህ ግለፅላቸው አለው፡፡ ይህ 40 ዘመን ዘግቶ የሚኖረው ባህታዊ መጥቅ መትቶ ሰበሰባቸው፡፡
 የወረደለትን ህብስት ሰማያዊ ፅዋ ሰማያዊ ለኢትዮጵያዊው ቅዱስ ካህን ንጉሥ ለሆነው ለቅዱስ ይምርሃነ ክርስቶስ የወረደ ለመሆኑ ገለፀላቸው፡፡ 
 እነዚህ የተሰበሰቡት ሰዎች 25 ጳጳሳት ከዚያም በላይ ካህናት፤ ዲያቆናት፤ መነኮሳት ብዙ ምዕመናን 14 እልፍ 400 ሺህ ግብፃዊያን መሄድ አለብን ለኢትዮጵያ የተሰጣትን እና የወረደላትን ሰማያዊ በረከት አይተን ይህን ቅዱስ የሆነ ካህንና ንጉሥ ከይምርሃነ ክርስቶስ እጅ ሥጋውንና ደሙን ተቀብለን እንሙት ብለው መንገዳቸውን ወደ ኢትዮጵያ ቀጠሉ፡፡ ከዚችው ቤተ መቅደስ ደረሱ፡፡ ኢትዮጵያው ንጉሥ ድንግልና ካህን ከሆነ ከቅዱስ ይምርሃነ ክርስቶስ እጅ ሰማያዊ ህብስትና ፅዋ ሰማያዊ አማናዊ የሆነውን የኢየሱስ ክርስቶስ ስጋና ደም ተቀብለው እንግዲህ ከዚሁ አርፈን ወደ እግዚአብሔር እንሔዳለንአሉ፡፡
  እነዚህ ሰዎች ከዚሁ እንዳሉ ጊዜያቸውን አድርሰው አረፉ፡፡ አዕማቸው ይህ የሚታየው ነው፡፡ 
  የ25ቱ ጳጳሳት መስቀላቸው ከዚሁ ቅዱስ ይምርሃነ ክርስቶስ ቤተ መቅደስ ውስጥ አለ፡፡ ለዓይን ያስደስታሉ፡፡ 2.16 እንግዳ ሆነው ይኖራሉ፡፡ እየመጣችሁ ተመልከቷቸው፡፡ 
  ተሳለሟቸው፣ ከሃጢያታችሁ ዳኑባቸው፡፡ ከቤተ መቅደሱ በስተ ምስራቅ ዋሻው ውስጥ ለውስጥ ወደ ዚግት እየተባለ ከሚጠራውና ወደ አቡነ ዮሴፍ ደብረ ማርያም እና እግዚአብሔር አብ ገዳም የሚወስድ የቅዱሳን ጎዳና _ አለበት፡፡ 
  _ ዞሮ ወደ ቅዱስ ላሊበላና ወደ ቅዱስ  ነአኩቶለአብ አሽተን ደብረ ጽዮን ማሪያም ከዚያም አልፎ ወደ እመኪና ልደታ ማርያም እና ወደ እመኪና መድኃኔዓለም ገዳማት የሚያስኬድ አለው፡፡ 
  ስለዚህ ከዚህ የሚታጠነው ማዕጠንት ቅዱስ ይምርሃነ ላይ በሁሉም ይደርሳል፡፡ 
  የቅዱስ ይምርሃነ ክርስቶስ ቤተ መቅደስ፣ ሁለተኛ የቅዱስ ነአኩቶለአብ ቤተ መቅደስ፤ ሶስተኛ የዘጊት አቡነ ግብረ መንፈስ ቅዱስ ቀደም ብሎ በዚያም ሶስቱ ቦታዎች ወግረ ስሂን ይባላሉ፡፡ 
  ምክንያቱም ከአንዱ የታጠነው ከሁሉም ስለሚተላለፍ ነው፡፡ `,
  },
];

const Harbe = () => {
  const [showFullText, setShowFullText] = useState([]);

  const toggleText = (id) => {
    setShowFullText(prevState => ({
      ...prevState,
      [id]: !prevState[id],
    }));
  };

  return (
    <ScrollView>
      {images.map((image) => (
        <View key={image.id} style={{ marginVertical: 10,marginBottom:70 }}>
          <ImageViewer
            imageUrls={[{ url: image.imageUrl }]}
            enableSwipeDown
            renderIndicator={() => null} 
            style={{ width: Dimensions.get('window').width, height: Dimensions.get('window').height / 2 }}
          />
          <View style={styles.descriptionContainer}>
            <Text>{showFullText[image.id] ? image.description : `${image.description.substring(0, 100)}...`}</Text>
            {image.description.length > 100 && (
              <TouchableOpacity onPress={() => toggleText(image.id)}>
                <Text style={styles.seeMore}>{showFullText[image.id] ? 'በከፊል ይዩ' : 'ሙሉውን ይዩ'}</Text>
              </TouchableOpacity>
            )}
          </View>
        </View>
      ))}
    </ScrollView>
  );
};

export default Harbe;

const styles = StyleSheet.create({
  descriptionContainer: {
    paddingHorizontal: 10,
    paddingTop: 10,
    marginBottom:70
  },
  seeMore: {
    color: 'blue',
    marginTop: 5,
  },
});
